tap 'homebrew/bundle'
tap 'homebrew/services'
tap  'homebrew/cask'

brew 'awscli'
brew 'chruby'
brew 'colordiff'
brew 'entr'
brew 'git'
brew 'go'
brew 'heroku'
brew 'httpie'
brew 'libmaxminddb'
brew 'mackup'
brew 'mas'
brew 'mysql'
brew 'node-build'
brew 'nodenv'
brew 'postgresql'
brew 'qt'
brew 'redis'
brew 'ripgrep'
brew 'svgo'
brew 'ruby-build'
brew 'tree'

# brew 'node'
# brew 'yarn --ignore-dependencies'
# brew 'candid82/brew/joker' # for visualclojure VSCode extension
# brew 'leiningen' # for clojure

# Mac apps, installed with https://caskroom.github.io/
# cask 'adoptopenjdk8'
cask 'alfred'
cask 'authy'
cask 'aws-vault'
cask 'docker'
cask 'dropbox'  ## Only likes being installed once.
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'handbrake'
cask 'imageoptim'
cask 'istat-menus'
cask 'iterm2'
cask 'karabiner-elements'
cask 'licecap'
cask 'muzzle'
cask 'sketch'
cask 'spectacle'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmission'
# cask 'virtualbox'

# Mac App Store apps, installed with https://github.com/mas-cli/mas
mas '1Password', id: 443987910
mas 'CCMenu', id: 603117688
mas 'Gifox', id: 1082624744
mas 'Houseparty', id: 1381523962
mas 'Slack', id: 803453959
mas 'Skitch', id: 425955336
mas 'Things3', id: 904280696

# mas 'Xcode', id: 497799835  ## installed separately first, see Readme

# Replaced by Notion
# mas 'TextWrangler', id: 404010395
# mas 'Evernote', id: 406056744
# mas 'Quiver', id: 866773894
