tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/cask'

brew 'awscli'
brew 'chruby'
brew 'entr'
brew 'git'
brew 'go'
brew 'heroku'
brew 'httpie'
brew 'hub'
brew 'leiningen'
brew 'libmaxminddb'
brew 'mackup'
brew 'mas'
brew 'mysql'
# brew 'node'
brew 'node-build'
brew 'nodenv'
brew 'phantomjs'
brew 'postgresql'
brew 'qt'
brew 'redis'
brew 'svgo'
brew 'ruby-install'
brew 'the_platinum_searcher'
brew 'tree'
# brew 'watchman'
brew 'yarn'

# Mac apps, installed with https://caskroom.github.io/
cask 'alfred'
cask 'atom'
cask 'authy'
cask 'aws-vault'
cask 'caffeine'
cask 'dbglass'
cask 'docker'
# cask 'dropbox'  ## Only likes being installed once.
cask 'firefox'
cask 'flux'
cask 'gimp'
cask 'google-chrome'
cask 'handbrake'
cask 'imageoptim'
cask 'inkscape'
cask 'istat-menus'
cask 'iterm2'
cask 'karabiner-elements'
cask 'licecap'
cask 'muzzle'
# cask 'psequel'  ## 15/5/18 Not working on MacOS 10.13 High Sierra
cask 'sketch'
# cask 'skitch'  ## Only likes being installed once. Installed via MAS CLI below.
cask 'spectacle'
cask 'the-unarchiver'
cask 'torbrowser'
cask 'transmission'
cask 'virtualbox'

# Mac App Store apps, installed with https://github.com/mas-cli/mas
mas '1Password', id: 443987910
mas 'CCMenu', id: 603117688
mas 'Evernote', id: 406056744
mas 'Quiver', id: 866773894
mas 'Slack', id: 803453959
mas 'Skitch', id: 425955336
mas 'TextWrangler', id: 404010395
mas 'Things3', id: 904280696
# mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835

